# Day-9 session - 05th March 2022 on python
1.Pandas

A.Creating an empty dataframe

B.Create dataframe from list range

C.Create dataframe with modified index values

D.Filter the dataframe and created another dataframe from the filtered data

E.Select the rows and columns bypassing the row index values and column names

F.Different functions using on Pandas ilac(), loc(), del, drop(), append(), reset_index(). Selecting the columns from the dataframe(cell : 175), head(), tail(), df1.T(TRANSFORM), axes, dtypes, empty, shape, dim(), sum(), sum(0/1), mean(), median(), mode(), std(), count(), min(), max(), describe(), apply(), lambda function usage in dataframe,

# Pandas

In [1]:
## every single column in the array is series

In [5]:
import numpy as np
import pandas as pd

# 1. Creating an empty dataframe

In [4]:
a = np.array([10, 2, 50, 70])

In [5]:
s = pd.Series(a)

In [6]:
df = pd.DataFrame()

In [7]:
print(df)

Empty DataFrame
Columns: []
Index: []

# 2. Create dataframe from list range

In [8]:
list1 = list(range(1,6)) 
df = pd.DataFrame(list1)
df

   0
0  1
1  2
2  3
3  4
4  5

In [9]:
#list2 = np.array([[10, 'Mahammad rafi'],[20, 'Apple'],[30, 'Mango']])
list2 = [[10, 'Mahammad rafi'],[20, 'Apple'],[30, 'Mango']]
df3 = pd.DataFrame(list2, columns = ['s.no', 'name'])
df3

   s.no           name
0    10  Mahammad rafi
1    20          Apple
2    30          Mango

# 3. Create dataframe with modified index values

In [10]:
dict1 = {'state': ['Tamilnadu','telangana','karanataka'], 'city': ['Chennai','Hyderabad','Banglore'], 'const': [10,20,30]}
df4 = pd.DataFrame(dict1)
print(df4)
df4 = pd.DataFrame(dict1, index=[1,2,3])
df4

        state       city  const
0   Tamilnadu    Chennai     10
1   telangana  Hyderabad     20
2  karanataka   Banglore     30

        state       city  const
1   Tamilnadu    Chennai     10
2   telangana  Hyderabad     20
3  karanataka   Banglore     30

# 4. Filter the dataframe and created another dataframe from the filtered data

In [11]:
df4['state']   ### Accessing the columns

1     Tamilnadu
2     telangana
3    karanataka
Name: state, dtype: object

In [12]:
df4[['state','city']]

        state       city
1   Tamilnadu    Chennai
2   telangana  Hyderabad
3  karanataka   Banglore

In [13]:

df4 = df4[['state','city']]

In [14]:
dict1 = {'state': ['Tamilnadu','telangana','karanataka'], 'city': ['Chennai','Hyderabad','Banglore'], 'const': [10,20,30]}
df4 = pd.DataFrame(dict1)
print(df4)

df_list_col = df4[['state','city']]
print(type(list_col))
df_list_col

        state       city  const
0   Tamilnadu    Chennai     10
1   telangana  Hyderabad     20
2  karanataka   Banglore     30

NameError: name 'list_col' is not defined

In [105]:
df4

        state       city  const
0   Tamilnadu    Chennai     10
1   telangana  Hyderabad     20
2  karanataka   Banglore     30

# 5. Select the rows and columns bypassing the row index values and column names

In [20]:
df4[0:2]

       state       city  const
0  Tamilnadu    Chennai     10
1  telangana  Hyderabad     20

In [21]:
df4[0:2]['state']

0    Tamilnadu
1    telangana
Name: state, dtype: object

In [22]:
df4.iloc[0:2, 0:2]  ## ['state', 'city']

       state       city
0  Tamilnadu    Chennai
1  telangana  Hyderabad

In [23]:
df4.iloc[0:2, 1:3]  ## ['state', 'city'] it will never take column name., it will take only indexes

        city  const
0    Chennai     10
1  Hyderabad     20

In [24]:
df4.loc[:, ['state', 'city']]

        state       city
0   Tamilnadu    Chennai
1   telangana  Hyderabad
2  karanataka   Banglore

In [25]:
df4.loc[:1, ['state', 'city']]

       state       city
0  Tamilnadu    Chennai
1  telangana  Hyderabad

In [26]:
df4.loc[1:2, ['state', 'city']]

        state       city
1   telangana  Hyderabad
2  karanataka   Banglore

In [27]:
dict2 = {'state': ['Tamilnadu','telangana','karanataka','goa'], 
        'city': ['Chennai','Hyderabad','Banglore','panaji'], 
         'const': [10,20,30,40], 
         'No_of_school': [100,200,300,105]}
df = pd.DataFrame(dict2)

In [28]:
df

        state       city  const  No_of_school
0   Tamilnadu    Chennai     10           100
1   telangana  Hyderabad     20           200
2  karanataka   Banglore     30           300
3         goa     panaji     40           105

In [29]:
df['No_of_hosp'] = pd.Series([5,13,12,4])

In [30]:
df

        state       city  const  No_of_school  No_of_hosp
0   Tamilnadu    Chennai     10           100           5
1   telangana  Hyderabad     20           200          13
2  karanataka   Banglore     30           300          12
3         goa     panaji     40           105           4

In [31]:
df['No_schools_req'] = df['const'] * df['No_of_school']

In [32]:
df

        state       city  const  No_of_school  No_of_hosp  No_schools_req
0   Tamilnadu    Chennai     10           100           5            1000
1   telangana  Hyderabad     20           200          13            4000
2  karanataka   Banglore     30           300          12            9000
3         goa     panaji     40           105           4            4200

In [33]:
del df['No_schools_req']

In [34]:
df

        state       city  const  No_of_school  No_of_hosp
0   Tamilnadu    Chennai     10           100           5
1   telangana  Hyderabad     20           200          13
2  karanataka   Banglore     30           300          12
3         goa     panaji     40           105           4

In [35]:
df['No_schools_req'] = df['const'] * df['No_of_school']

In [36]:
df

        state       city  const  No_of_school  No_of_hosp  No_schools_req
0   Tamilnadu    Chennai     10           100           5            1000
1   telangana  Hyderabad     20           200          13            4000
2  karanataka   Banglore     30           300          12            9000
3         goa     panaji     40           105           4            4200

In [37]:
df.drop('No_schools_req', axis=1, inplace=True)

In [38]:
df

        state       city  const  No_of_school  No_of_hosp
0   Tamilnadu    Chennai     10           100           5
1   telangana  Hyderabad     20           200          13
2  karanataka   Banglore     30           300          12
3         goa     panaji     40           105           4

In [39]:
df['No_schools_req'] = df['const'] * df['No_of_school']

In [40]:
df['No_hosp_req'] = df['const'] * df['No_of_hosp']

In [41]:
df

,state,city,const,No_of_school,No_of_hosp,No_schools_req,No_hosp_req
0,Tamilnadu,Chennai,10,100,5,1000,50
1,telangana,Hyderabad,20,200,13,4000,260
2,karanataka,Banglore,30,300,12,9000,360
3,goa,panaji,40,105,4,4200,160

In [42]:
df.drop(['No_schools_req', 'No_hosp_req'], axis = 1, inplace = True)

In [43]:
df

        state       city  const  No_of_school  No_of_hosp
0   Tamilnadu    Chennai     10           100           5
1   telangana  Hyderabad     20           200          13
2  karanataka   Banglore     30           300          12
3         goa     panaji     40           105           4

In [47]:
df['No_schools_req'] = df['const'] * df['No_of_school']
df['No_hosp_req'] = df['const'] * df['No_of_hosp']

In [61]:
df['No_of_libr'] = pd.Series([15,23,21,14])

In [57]:
df

,state,city,const,No_of_school,No_of_hosp,No_schools_req,No_hosp_req
0,Tamilnadu,Chennai,10,100,5,1000,50
1,telangana,Hyderabad,20,200,13,4000,260
2,karanataka,Banglore,30,300,12,9000,360
3,goa,panaji,40,105,4,4200,160

In [62]:
del df['No_of_libr']

In [51]:
df

,state,city,const,No_of_school,No_of_hosp,No_schools_req,No_hosp_req
0,Tamilnadu,Chennai,10,100,5,1000,50
1,telangana,Hyderabad,20,200,13,4000,260
2,karanataka,Banglore,30,300,12,9000,360
3,goa,panaji,40,105,4,4200,160

In [52]:
df['No_of_libr'] = pd.Series(['fifteen','thirteen','twenty','thirty'], index=[0,1,2,3])
df

,state,city,const,No_of_school,No_of_hosp,No_schools_req,No_hosp_req,No_of_libr
0,Tamilnadu,Chennai,10,100,5,1000,50,fifteen
1,telangana,Hyderabad,20,200,13,4000,260,thirteen
2,karanataka,Banglore,30,300,12,9000,360,twenty
3,goa,panaji,40,105,4,4200,160,thirty

In [53]:
dict3 = {'state': ['Tamilnadu','telangana','karanataka','goa'], 
        'city': ['Chennai','Hyderabad','Banglore','panaji'], 
         'const': [10,20,30,40], 
         'No_of_school': [100,200,300,105]}
df1 = pd.DataFrame(dict3)

In [54]:
df3 = df.append(df1)
df3

,state,city,const,No_of_school,No_of_hosp,No_schools_req,No_hosp_req,No_of_libr
0,Tamilnadu,Chennai,10,100,5.0,1000.0,50.0,fifteen
1,telangana,Hyderabad,20,200,13.0,4000.0,260.0,thirteen
2,karanataka,Banglore,30,300,12.0,9000.0,360.0,twenty
3,goa,panaji,40,105,4.0,4200.0,160.0,thirty
0,Tamilnadu,Chennai,10,100,NaN,NaN,NaN,NaN
1,telangana,Hyderabad,20,200,NaN,NaN,NaN,NaN
2,karanataka,Banglore,30,300,NaN,NaN,NaN,NaN
3,goa,panaji,40,105,NaN,NaN,NaN,NaN

In [55]:
df3.reset_index()

,index,state,city,const,No_of_school,No_of_hosp,No_schools_req,No_hosp_req,No_of_libr
0,0,Tamilnadu,Chennai,10,100,5.0,1000.0,50.0,fifteen
1,1,telangana,Hyderabad,20,200,13.0,4000.0,260.0,thirteen
2,2,karanataka,Banglore,30,300,12.0,9000.0,360.0,twenty
3,3,goa,panaji,40,105,4.0,4200.0,160.0,thirty
4,0,Tamilnadu,Chennai,10,100,NaN,NaN,NaN,NaN
5,1,telangana,Hyderabad,20,200,NaN,NaN,NaN,NaN
6,2,karanataka,Banglore,30,300,NaN,NaN,NaN,NaN
7,3,goa,panaji,40,105,NaN,NaN,NaN,NaN

In [63]:
list1 = [[10, 'Mahammad rafi'],[20, 'Apple'],[30, 'Mango']]

In [66]:
list2 = [[1,'teacher1'],[2,'teacher1'],[3,'teacher1']]

In [67]:
list1 = [[25, 'Tom', 4.23], [26, 'Jams', 3.24], [25, 'Ricky', 3.98], [23, 'Vin', 2.56], [30, 'Steve', 3.20], [29, 'Smith', 4.60], [23, 'Jeak', 3.80]]

In [68]:
df1 = pd.DataFrame(list1, columns = ['Age', 'Name', 'Rating'])

In [69]:
df1

   Age   Name  Rating
0   25    Tom    4.23
1   26   Jams    3.24
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  Steve    3.20
5   29  Smith    4.60
6   23   Jeak    3.80

In [70]:
df1.head()

   Age   Name  Rating
0   25    Tom    4.23
1   26   Jams    3.24
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  Steve    3.20

In [71]:
df1.tail()

   Age   Name  Rating
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  Steve    3.20
5   29  Smith    4.60
6   23   Jeak    3.80

In [72]:
df1.head(1)

   Age Name  Rating
0   25  Tom    4.23

In [73]:
df1.tail(1)

   Age  Name  Rating
6   23  Jeak     3.8

In [74]:
df1.T

           0     1      2     3      4      5     6
Age       25    26     25    23     30     29    23
Name     Tom  Jams  Ricky   Vin  Steve  Smith  Jeak
Rating  4.23  3.24   3.98  2.56    3.2    4.6   3.8

In [75]:
df1

   Age   Name  Rating
0   25    Tom    4.23
1   26   Jams    3.24
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  Steve    3.20
5   29  Smith    4.60
6   23   Jeak    3.80

In [76]:
df1.axes   ## information about the dataframe of rows indexes and collumns

[RangeIndex(start=0, stop=7, step=1),
 Index(['Age', 'Name', 'Rating'], dtype='object')]

In [77]:
df1.dtypes   ## datatype of each columns

Age         int64
Name       object
Rating    float64
dtype: object

In [78]:
df1.empty  ## it will tell whether empty values in the dataframe

False

In [79]:
df1.shape      ## dimension

(7, 3)

In [80]:
df1.sum()    ## it will sum in column wise

Age                                 181
Name      TomJamsRickyVinSteveSmithJeak
Rating                            25.61
dtype: object

In [81]:
df1.sum(axis = 0)

Age                                 181
Name      TomJamsRickyVinSteveSmithJeak
Rating                            25.61
dtype: object

In [82]:
df1.sum(0)

Age                                 181
Name      TomJamsRickyVinSteveSmithJeak
Rating                            25.61
dtype: object

In [83]:
df1.sum(axis = 1)

C:\Users\maham\AppData\Local\Temp/ipykernel_5904/256017551.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df1.sum(axis = 1)

0    29.23
1    29.24
2    28.98
3    25.56
4    33.20
5    33.60
6    26.80
dtype: float64

In [84]:
df1.sum(1)

C:\Users\maham\AppData\Local\Temp/ipykernel_5904/1060568946.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df1.sum(1)

0    29.23
1    29.24
2    28.98
3    25.56
4    33.20
5    33.60
6    26.80
dtype: float64

In [85]:
df1.mean()

C:\Users\maham\AppData\Local\Temp/ipykernel_5904/2053335143.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df1.mean()

Age       25.857143
Rating     3.658571
dtype: float64

In [86]:
df1.sum(0,2)

Age                                 181
Name      TomJamsRickyVinSteveSmithJeak
Rating                            25.61
dtype: object

In [87]:
import warnings
warnings.filterwarnings('ignore')

In [88]:
df1.mean()

Age       25.857143
Rating     3.658571
dtype: float64

In [89]:
df1.median()

Age       25.0
Rating     3.8
dtype: float64

In [90]:
df1['Age'].mode()  ## more times repeated values

0    23
1    25
dtype: int64

In [91]:
df1['Age']

0    25
1    26
2    25
3    23
4    30
5    29
6    23
Name: Age, dtype: int64

In [92]:
df1.std()

Age       2.734262
Rating    0.698628
dtype: float64

In [93]:
df1['Name'].mode()

0     Jams
1     Jeak
2    Ricky
3    Smith
4    Steve
5      Tom
6      Vin
dtype: object

In [94]:
df1.mode()   ##useless this example command and realtime we won't use it

# if you pass column name in the mode function, then it will be meaningful

    Age   Name  Rating
0  23.0   Jams    2.56
1  25.0   Jeak    3.20
2   NaN  Ricky    3.24
3   NaN  Smith    3.80
4   NaN  Steve    3.98
5   NaN    Tom    4.23
6   NaN    Vin    4.60

In [95]:
df1.mode(1)

    0      1     2
0  25    Tom  4.23
1  26   Jams  3.24
2  25  Ricky  3.98
3  23    Vin  2.56
4  30  Steve  3.20
5  29  Smith  4.60
6  23   Jeak  3.80

In [96]:
df1.std()  ## how far the values are deviated from the mean

Age       2.734262
Rating    0.698628
dtype: float64

In [97]:
df1.count()   ## null(nan) values are not considered(ignored)

Age       7
Name      7
Rating    7
dtype: int64

In [98]:
df1['Age'].min()

23

In [99]:
df1['Age'].max()

30

In [100]:
df1_descr = pd.DataFrame(df1.describe())   ## statistics of the data frame
df1_descr

             Age    Rating
count   7.000000  7.000000
mean   25.857143  3.658571
std     2.734262  0.698628
min    23.000000  2.560000
25%    24.000000  3.220000
50%    25.000000  3.800000
75%    27.500000  4.105000
max    30.000000  4.600000

In [101]:
dic = {'Col1': [20, 50, 60, 70, 80],
       'Col2': [80, 60, 40, 20, 55],
       'Col3' :[20, 80, 55, 66, 33]}
df2 = pd.DataFrame(dic)
df2

   Col1  Col2  Col3
0    20    80    20
1    50    60    80
2    60    40    55
3    70    20    66
4    80    55    33

In [102]:
df2.apply(np.mean)

Col1    56.0
Col2    51.0
Col3    50.8
dtype: float64

In [103]:
df2.apply(np.max)

Col1    80
Col2    80
Col3    80
dtype: int64

In [104]:
df2.apply(lambda x:x.max() - x.min())

Col1    60
Col2    60
Col3    60
dtype: int64